# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect
 
# Parameters
nc: 12  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs
 
# YOLOv8.0n backbone
backbone:
  # [from, number, module, args]
  [ [ -1, 1, StemBlock, [32, 3, 2] ],    # 0-P2/4
    [ -1, 1, Shuffle_Block, [96, 2]], # 1-P3/8
    [ -1, 3, Shuffle_Block, [96, 1]], # 2
    [ -1, 1, Shuffle_Block, [192, 2]], # 3-P4/16
    [ -1, 7, Shuffle_Block, [192, 1]], # 4
    [ -1, 1, Shuffle_Block, [384, 2]], # 5-P5/32
    [ -1, 3, Shuffle_Block, [384, 1]], # 6
    [ -1, 1, SPPF, [384, 5]],]
  
# v5lite-e head
head:
  [ [ -1, 1, Conv, [96, 1, 1]],
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest']],
    [[ -1, 4], 1, Concat, [1]],  # cat backbone P4
    [ -1, 1, DWConvblock, [96, 3, 1]],  # 11
 
    [ -1, 1, Conv, [96, 1, 1]],
    [ -1, 1, nn.Upsample, [ None, 2, 'nearest']],
    [[ -1, 2], 1, Concat, [1]],  # cat backbone P3
    [ -1, 1, DWConvblock, [96, 3, 1] ],  # 15 (P3/8-small)
 
    [-1, 1, DWConvblock, [96, 3, 2]],
    [[ -1, 12], 1, ADD, [1]],  # cat head P4
    [ -1, 1, DWConvblock, [96, 3, 1]],  # 18 (P4/16-medium)
 
    [ -1, 1, DWConvblock, [96, 3, 2]],
    [[ -1, 8], 1, ADD, [1]],  # cat head P5
    [ -1, 1, DWConvblock, [96, 3, 1]],  # 21 (P5/32-large)
 
    [[ 15, 18, 21], 1, Detect, [nc]],]  # Detect(P3, P4, P5)
  
 
 